[
    {
        "name": "Stan Marsh",
        "description": "Stanley 'Stan' Marsh is one of the show's four central characters and is voiced by and loosely based on series co-creator Trey Parker. He first appeared in The Spirit of Christmas and is portrayed (in words of the show's official website) as 'a normal, average, American, mixed-up kid'. Stan is a third- then fourth-grade student who commonly has extraordinary experiences not typical of conventional small-town life in his hometown of South Park. He is also commonly portrayed as the main protagonist of the series, as in most episodes he plays this role. He is well known for the phrase 'Oh my God! They killed Kenny!' which he says in many episodes whenever Kenny is subjected to painful and often gruesome deaths, and this phrase is very well known throughout popular culture.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/StanMarsh.png/130px-StanMarsh.png"
    },
    {
        "name": "Kyle Broflovski",
        "description": "Kyle Broflovski is one of the show's four central characters and is voiced by and loosely based on series co-creator Matt Stone. Having appeared first in The Spirit of Christmas shorts, he often displays the highest moral standard of all the boys and is usually depicted as the most intelligent. When describing Kyle, Stone states that both he and the character are 'reactionary', and susceptible to irritability and impatience. In some instances, Kyle is the only child in his class to not initially indulge in a fad or fall victim to a ploy. This has resulted in both his eagerness to fit in, and his resentment and frustration. Kyle is distinctive as one of the few Jewish children on the show, and because of this, he often feels like an outsider amongst the core group of characters. His portrayal in this role is often dealt with satirically, and has elicited both praise and criticism from Jewish viewers. In many episodes, Kyle contemplates ethics in beliefs, moral dilemmas, and contentious issues, and will often reflect on the lessons he has attained with a speech that often begins with 'You know, I learned something today...'",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/2/25/KyleBroflovski.png/165px-KyleBroflovski.png"
    },
    {
        "name": "Eric Cartman",
        "description": "Eric Theodore Cartman first appeared in the 1992 short series 'Jesus vs Frosty' and is voiced by Trey Parker. Cartman has been portrayed as aggressive, prejudiced and emotionally unstable since his character's inception. These traits are significantly augmented in later seasons as his character evolves, and he begins to exhibit psychopathic and extremely manipulative behavior. He is depicted as highly intelligent, able to execute morally appalling plans and business ideas with success. Among the show's main child characters, Cartman is distinguished as 'the fat kid', for which he is continuously insulted and ridiculed. Cartman is frequently portrayed as a villain whose actions set in motion the events serving as the main plot of an episode. Other children and classmates are alienated by Cartman's insensitive, racist, homophobic, anti-semitic, misogynistic, lazy, self-righteous, and wildly insecure behavior. Cartman often makes anti-semitic insults towards Kyle, constantly teases Kenny for being poor,[39] particularly manipulates and mistreats Butters Stotch and displays an extreme disdain for hippies. Though he is considered the main antagonist of the series, he has been portrayed as a protagonist or antihero on several occasions.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/7/77/EricCartman.png/220px-EricCartman.png"
    },
    {
        "name": "",
        "description": "",
        "image_source": ""
    },
    {
        "name": "",
        "description": "",
        "image_source": ""
    },    {
        "name": "",
        "description": "",
        "image_source": ""
    },
    {
        "name": "",
        "description": "",
        "image_source": ""
    }
]