[
    {
        "name": "Stan Marsh",
        "short_description": "Stanley 'Stan' Marsh is one of the show's four central characters and is voiced by and loosely based on series co-creator Trey Parker. He first appeared in The Spirit of Christmas and is portrayed as 'a normal, average, American, mixed-up kid'.",
        "description": "Stanley 'Stan' Marsh is one of the show's four central characters and is voiced by and loosely based on series co-creator Trey Parker. He first appeared in The Spirit of Christmas and is portrayed (in words of the show's official website) as 'a normal, average, American, mixed-up kid'. Stan is a third- then fourth-grade student who commonly has extraordinary experiences not typical of conventional small-town life in his hometown of South Park. He is also commonly portrayed as the main protagonist of the series, as in most episodes he plays this role. He is well known for the phrase 'Oh my God! They killed Kenny!' which he says in many episodes whenever Kenny is subjected to painful and often gruesome deaths, and this phrase is very well known throughout popular culture.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/a/a7/StanMarsh.png/130px-StanMarsh.png",
        "url": "stan"
    },
    {
        "name": "Kyle Broflovski",
        "short_description": "Kyle Broflovski is one of the show's four central characters and is voiced by and loosely based on series co-creator Matt Stone. Having appeared first in The Spirit of Christmas shorts, he often displays the highest moral standard of all the boys and is usually depicted as the most intelligent.",
        "description": "Kyle Broflovski is one of the show's four central characters and is voiced by and loosely based on series co-creator Matt Stone. Having appeared first in The Spirit of Christmas shorts, he often displays the highest moral standard of all the boys and is usually depicted as the most intelligent. When describing Kyle, Stone states that both he and the character are 'reactionary', and susceptible to irritability and impatience. In some instances, Kyle is the only child in his class to not initially indulge in a fad or fall victim to a ploy. This has resulted in both his eagerness to fit in, and his resentment and frustration. Kyle is distinctive as one of the few Jewish children on the show, and because of this, he often feels like an outsider amongst the core group of characters. His portrayal in this role is often dealt with satirically, and has elicited both praise and criticism from Jewish viewers. In many episodes, Kyle contemplates ethics in beliefs, moral dilemmas, and contentious issues, and will often reflect on the lessons he has attained with a speech that often begins with 'You know, I learned something today...'",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/2/25/KyleBroflovski.png/165px-KyleBroflovski.png",
        "url": "kyle"
    },
    {
        "name": "Eric Cartman",
        "short_description": "Eric Theodore Cartman first appeared in the 1992 short series 'Jesus vs Frosty' and is voiced by Trey Parker. Cartman has been portrayed as aggressive, prejudiced and emotionally unstable since his character's inception.",
        "description": "Eric Theodore Cartman first appeared in the 1992 short series 'Jesus vs Frosty' and is voiced by Trey Parker. Cartman has been portrayed as aggressive, prejudiced and emotionally unstable since his character's inception. These traits are significantly augmented in later seasons as his character evolves, and he begins to exhibit psychopathic and extremely manipulative behavior. He is depicted as highly intelligent, able to execute morally appalling plans and business ideas with success. Among the show's main child characters, Cartman is distinguished as 'the fat kid', for which he is continuously insulted and ridiculed. Cartman is frequently portrayed as a villain whose actions set in motion the events serving as the main plot of an episode. Other children and classmates are alienated by Cartman's insensitive, racist, homophobic, anti-semitic, misogynistic, lazy, self-righteous, and wildly insecure behavior. Cartman often makes anti-semitic insults towards Kyle, constantly teases Kenny for being poor, particularly manipulates and mistreats Butters Stotch and displays an extreme disdain for hippies. Though he is considered the main antagonist of the series, he has been portrayed as a protagonist or antihero on several occasions.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/7/77/EricCartman.png/220px-EricCartman.png",
        "url": "eric"
    },
    {
        "name": "Kenny McCormick",
        "short_description": "Kenneth 'Kenny' McCormick is one of the shows' main characters who debuted in the 1992 short. His oft-muffled and indiscernible speech—the result of his parka hood covering his mouth—is voiced by co-creator Matt Stone. He is friends with Stan and Kyle, while maintaining a friendship with Eric Cartman.",
        "description": "Kenneth 'Kenny' McCormick is one of the shows' main characters who debuted in the 1992 short. His oft-muffled and indiscernible speech—the result of his parka hood covering his mouth—is voiced by co-creator Matt Stone. He is friends with Stan and Kyle, while maintaining a friendship with Eric Cartman. Kenny is regularly teased for living in poverty, particularly by Cartman. Prior to Season Six, Kenny died in almost every episode, with only a few exceptions. The nature of the deaths was often gruesome and portrayed in a comically absurd fashion, and usually followed by Stan and Kyle respectively yelling 'Oh my God! They killed Kenny!' and 'You bastard(s)!'. In the episode 'Kenny Dies', Kenny dies after developing a terminal muscular disease, while Parker and Stone claimed that Kenny would not be returning in subsequent episodes and insisted they grew tired of having Kenny die in each episode. For most of season six, his place is taken by Butters Stotch and Tweek Tweak. Nevertheless, Kenny returned from the year-long absence in the season six finale 'Red Sleigh Down', and has remained a starring character since, although he only appears once in 1 episode in Season 20. His character no longer dies each week, and has only been killed occasionally in episodes following his return. Kenny's superhero alter ego, Mysterion, first appeared in the season 13 episode 'The Coon'. It is revealed in the season 14 episode 'Coon vs. Coon and Friends' that Kenny canonically has an ability to resurrect after dying, though he is always the only one who can ever remember dying, despite his friends always bearing witness. It is revealed that each time he dies, Kenny's mom spontaneously gives birth to him, and then is put back in his orange parka and in bed, to regenerate overnight. This was due to his parents’ involvement in the cult of Cthulhu, whose meetings they would only attend because of the free alcohol.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/6/6f/KennyMcCormick.png/150px-KennyMcCormick.png",
        "url": "kenny"
    },
    {
        "name": "Butters Stotch",
        "short_description": "Stotch is cheerful, naive, optimistic, sweet-natured, gullible and more passive relative to the show's other child characters, and can become increasingly anxious, especially when faced with the likelihood of his parents' punishments, which is usually being grounded, usually, for no good reason.",
        "description": "Voiced by Matt Stone; Leopold 'Butters' Stotch is cheerful, naive, optimistic, sweet-natured, gullible and more passive relative to the show's other child characters, and can become increasingly anxious, especially when faced with the likelihood of his parents' punishments, which is usually being grounded, usually, for no good reason, such as when Butters threatened to 'kill' himself as part of a scheme by Stan, Kyle, Kenny and Cartman, and his parents said they would 'only' ground him for two weeks if he came down. Butters usually doesn't indulge in a foul-mouthed language like the other children and speaks with a mild stutter and tends to fidget with his hands. The other characters perceive him as 'nerdy' and he obliviously maintains a very wholesome attitude and mild disposition despite the tragedy and abuse that he frequently encounters from both his classmates and parents. His happy-go-lucky persona has been described as resembling that of a typical 1950s sitcom child character and is usually presented in stark contrast to the harsh treatment he receives at the hands of his friends and strict parents, Butters appeared initially as a background character in first the episode, 'Cartman Gets an Anal Probe', but gradually became one of Parker and Stone's favorite characters. Besides wanting to genuinely surprise fans, Parker and Stone killed Kenny at the end of season five to allow an opportunity to provide a major role for Butters, as his following episode, revolves entirely around him. Stan, Kyle, and Cartman allow him into their group as the 'fourth friend', but eventually adopts his super-villain alter ego of Professor Chaos, whom, in spite of his name, only seems to be able to screw things up that either nobody takes notice of, or can be easily resolved. Despite this, Butters has continued to be a major character in recent seasons and continues to be a frequent source of help to Cartman, while also being the main victim of Cartman's constant pranking and manipulation.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/0/06/ButtersStotch.png/130px-ButtersStotch.png",
        "url": "butters"
    },
    {
        "name": "Randy and Sharon Marsh",
        "short_description": "Randy and Sharon Marsh are the most prominent set of parents on the show. They are a middle-class married couple who raise their 10-year-old son Stan and 13-year-old daughter Shelly.",
        "description": "Randy and Sharon Marsh are the most prominent set of parents on the show. They are a middle-class married couple who raise their 10-year-old son Stan and 13-year-old daughter Shelly. Randy is 45 years old, and like Parker's father, is a geologist, making his first appearance in the series while monitoring a seismometer in the episode 'Volcano'. He was depicted to work at the South Park Center for Seismic Activity, and was later shown to work for the U. S. Geological Survey. He was briefly fired from his geologist job near the end of the 12th season, and quit briefly during the end of the 14th season, but has since been-rehired both times. He also serves on the city council, specializing in the town's parks and public grounds.</p>A recurring character trait of Randy's is his being prone to overreacting and obsessively seizing upon irrational ideas and fads, whether by himself or as part of a large contingent of the town's adult population.Though the show frequently depicts him to be a moderate to heavy drinker, numerous episodes have dealt with Randy's belligerent and negligent behavior brought upon by his severe intoxication.A few instances of personal achievement have made Randy a hero in the eyes of his friends and fellow townsfolk, such as being awarded a Nobel Prize, and twice setting a record for producing the world's largest piece of human excrement.  Sharon is a 42-year-old receptionist. Sharon has never been portrayed in a work capacity in the series, but was depicted as the receptionist at Tom’s Rhinoplasty, a local surgical clinic, in South Park: Bigger, Longer & Uncut and South Park: The Stick of Truth.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/2/2b/Randy_and_Sharon_Marsh.png/220px-Randy_and_Sharon_Marsh.png",
        "url": "randy_and_sharon"
    },
    {
        "name": "Wendy Testaburger",
        "short_description": "Wendy Testaburger is the show's most prominent female student. Her best friend is Bebe Stevens, she is the on-and-off girlfriend of Stan. Wendy has previously been voiced by Karri Turner (in the unaired pilot), Mary Kay Bergman, Mona Marshall, Eliza Schneider, and is currently voiced by April Stewart.",
        "description": "Wendy Testaburger is the show's most prominent female student. Her best friend is Bebe Stevens, she is the on-and-off girlfriend of Stan. Wendy has previously been voiced by Karri Turner (in the unaired pilot), Mary Kay Bergman, Mona Marshall, Eliza Schneider, and is currently voiced by April Stewart. Fellow co-creator Matt Stone has also cited the name of Wendy Westerberg, the wife of an old friend from his childhood. She wears a pink beret and a purple coat. She has long black hair with uneven bangs. Wendy made her first appearance unnamed, but clearly recognizable, in 'The Spirit of Christmas'. Like her boyfriend Stan, Wendy is mature for her age, critical of popular trends, moral and intellectual, as well as being a feminist, as noted in many of her appearances. She campaigns in several episodes on causes such as breast cancer and the suffering of Bottlenose dolphins, often arguing with Eric Cartman who calls her a 'bitch' or 'ho' in response. Although the two generally only argue, he pushes her to the limit in the Season 12 (2008) episode 'Breast Cancer Show Ever' wherein the two engage in a fight on the playground, in which Wendy badly beats up Cartman. Wendy is known to be protective of her relationship with Stan. In the Season 1 (1997) episode 'Tom's Rhinoplasty' when Stan, along with the other boys, falls in love with an attractive substitute teacher, Wendy accuses her of stealing Stan from her, and eventually formulates a complex plan to get her thrown into the sun. She also sometimes displays jealousy – in the Season 6 (2002) episode 'Bebe's Boobs Destroy Society', her best friend, Bebe Stevens, receives more attention than she does because of Bebe's developing breasts. Wendy then gets breast implants, but the boys end up ridiculing her after only just realizing the control Bebe's breasts had on them. This behavior is somewhat contradicted by episodes such as 'Stupid Spoiled Whore Video Playset' and 'Dances with Smurfs' where she is more concerned with principles than trends and attention.",
        "image_source": "https://upload.wikimedia.org/wikipedia/en/thumb/a/ab/Wendy_South_Park.png/150px-Wendy_South_Park.png",
        "url": "wendy"
    }
]